Repository: iRingil/open-weather-bot
Catalog: tgbot/locales/*/LC_MESSAGES/tgbot.po
Languages: ru, uk

source: Statistics
ru: Статистика
uk: Статистика

source: Since beginning of the month
ru: С начала текущего месяца
uk: З початку поточного місяця

source: requests have been spent
ru: запросов было использовано
uk: запитів було використано

source: out of
ru: из
uk: з

source: Users in the database
ru: Пользователей в базе данных
uk: Користувачів у базі даних

source: OpenWeatherBot is written in Python using the Aiogram 2 framework
ru: OpenWeatherBot написан на Python с использованием фреймворка Aiogram 2
uk: OpenWeatherBot написаний на Python з використанням фреймворку Aiogram 2.

source: Weather data provided by
ru: Данные о погоде предоставлены
uk: Дані про погоду надані

source: Icon by
ru: Иконки от
uk: Іконки від

source: on
ru: с
uk: з

source: The source code is available on
ru: Исходный код доступен на
uk: Вихідний код доступний на

source: All of your data has been deleted
ru: Все твои данные были удалены
uk: Всі ваші дані були видалені

source: Let's set the weather!
ru: Давай установим погоду!
uk: Давай встановимо погоду!

source: Write the name of the city or send your coordinates:
ru: Напиши название города или отправь свои координаты:
uk: Вкажи назву міста або надішли свої координати:

source: Select the desired city:
ru: Выбери нужный город:
uk: Обери бажане місто:

source: I couldn't find a single city!
ru: Я не смог найти ни одного города!
uk: Я не зміг знайти жодного міста!

source: Try changing the name of the city:
ru: Попробуй изменить название города:
uk: Спробуй змінити назву міста:

source: Choose units of temperature measurement:
ru: Выбери единицы измерения температуры:
uk: Обери одиниці вимірювання температури:

source: The weather setup is complete.
ru: Настройка погоды завершена.
uk: Налаштування погоди завершено.

source: The data will be updated automatically every 3 hours.
ru: Данные будут обновляться автоматически каждые 3 часа.
uk: Дані будуть оновлюватися автоматично кожні 3 години.

source: Select another city:
ru: Выбери другой город:
uk: Обери інше місто:

source: Send geolocation
ru: Отправить геолокацию
uk: Надіслати геолокацію

source: Set weather forecast
ru: Настроить прогноз погоды
uk: Налаштувати прогноз погоди

source: Bot info
ru: Информация о боте
uk: Інформація про бота

source: Stop bot and delete data
ru: Остановить бота и удалить данные
uk: Зупинити бота і видалити дані

source: of precipitation in one hour
ru: осадков выпадет в течение одного часа
uk: опадів випаде протягом однієї години

source: gusts to
ru: порывы до
uk: пориви до

source: Visibility
ru: Видимость
uk: Видимість

source: feels like
ru: ощущается как
uk: відчувається як

source: Humidity
ru: Влажность
uk: Вологість

source: Dew point
ru: Точка росы
uk: Точка роси

source: Wind speed
ru: Скорость ветра
uk: Швидкість вітру

source: Pressure
ru: Давление
uk: Тиск

source: Sunrise
ru: Восход
uk: Схід

source: Sunset
ru: Закат
uk: Захід

source: Failed to obtain data about the current weather.
ru: Не удалось получить данные о текущей погоде
uk: Не вдалося отримати дані про поточну погоду.
